In [1]:
import pandas as pd

In [6]:
df=pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[5,6,7,5],
    'col3':['a','b','c','d']
})

In [7]:
df

   col1  col2 col3
0     1     5    a
1     2     6    b
2     3     7    c
3     4     5    d

In [8]:
df['col2'].unique()

array([5, 6, 7], dtype=int64)

In [9]:
df['col2'].nunique()

3

In [11]:
df['col2'].value_counts()

5    2
7    1
6    1
Name: col2, dtype: int64

In [13]:
df[df['col2']>5]

   col1  col2 col3
1     2     6    b
2     3     7    c

In [15]:
df[(df['col2']>5)&(df['col2']==7)]

   col1  col2 col3
2     3     7    c

In [16]:
def times2(x):
    return x*2

In [17]:
df['col2'].apply(times2)

0    10
1    12
2    14
3    10
Name: col2, dtype: int64

In [18]:
df['col3'].apply(len)

0    1
1    1
2    1
3    1
Name: col3, dtype: int64

In [19]:
df['col2'].apply(lambda x:x*2)

0    10
1    12
2    14
3    10
Name: col2, dtype: int64

In [20]:
df.drop('col2',axis=1)

   col1 col3
0     1    a
1     2    b
2     3    c
3     4    d

In [21]:
df

   col1  col2 col3
0     1     5    a
1     2     6    b
2     3     7    c
3     4     5    d

In [22]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [24]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [29]:
a=pd.DataFrame({'0':[1]},['A'])

In [30]:
a

   0
A  1

In [31]:
a.index

Index(['A'], dtype='object')

In [32]:
df.sort_values('col2')

   col1  col2 col3
0     1     5    a
3     4     5    d
1     2     6    b
2     3     7    c

In [33]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [40]:
df=pd.DataFrame({
    'A':['f','f','f','b','b','b'],
    'B':['1','1','2','2','1','1'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
})

In [41]:
df

   A  B  C  D
0  f  1  x  1
1  f  1  y  3
2  f  2  x  2
3  b  2  y  5
4  b  1  x  4
5  b  1  y  1

In [42]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C      x    y
A B
b 1  4.0  1.0
  2  NaN  5.0
f 1  1.0  3.0
  2  2.0  NaN